In [56]:
import pandas as pd

In [57]:
df = pd.DataFrame(['Mr', 'Mrs', 'Miss', 'Mr', 'Mrs', 'Mrs', 'King', 'Man'], columns=['Title'])

In [58]:
df

  Title
0    Mr
1   Mrs
2  Miss
3    Mr
4   Mrs
5   Mrs
6  King
7   Man

In [59]:
# Group titles together
female_list = ['Countess', 'Lady', 'Miss', 'Mlle', 'Mme', 'Mrs', 'Ms']
royal_list = ['Col', 'Don', 'Dr', 'Jonkheer', 'Major', 'Sir']
male_list = ['Capt', 'Mr', 'Rev']

In [60]:
df['NewTitle'] = df['Title']
df

  Title NewTitle
0    Mr       Mr
1   Mrs      Mrs
2  Miss     Miss
3    Mr       Mr
4   Mrs      Mrs
5   Mrs      Mrs
6  King     King
7   Man      Man

In [61]:
df2 = df.copy()

In [62]:
for column in df:
    print(column)

Title
NewTitle

In [63]:
for value in df['Title']:
    print(value)

Mr
Mrs
Miss
Mr
Mrs
Mrs
King
Man

In [64]:
df['Title'].isin(female_list)

0    False
1     True
2     True
3    False
4     True
5     True
6    False
7    False
Name: Title, dtype: bool

In [65]:
all_females = df['Title'].isin(female_list)

In [66]:
if df['Title'][0] in (female_list):
    print('yes')
else:
    print('no')

no

In [67]:
if df['Title'][0] in (male_list):
    print('yes')
else:
    print('no')

yes

In [68]:
for i in df['Title']:
    print(i)
    if i in female_list:
        print('Found title...')
        print('Changing title to ' + 'Female')

Mr
Mrs
Found title...
Changing title to Female
Miss
Found title...
Changing title to Female
Mr
Mrs
Found title...
Changing title to Female
Mrs
Found title...
Changing title to Female
King
Man

In [69]:
for i in df['Title']:
    if i in female_list:
        print(i)
        i = 'Female'
        print(i)

Mrs
Female
Miss
Female
Mrs
Female
Mrs
Female

In [70]:
for value in df['Title']:
    if value in female_list:
        df['NewTitle'] == 'Female'
    elif value in male_list:
        df['NewTitle'] == 'Male'
    else:
        df['NewTitle'] == 'Royalty'

In [71]:
df['NewTitle'].iloc[1]

'Mrs'

In [72]:
df

  Title NewTitle
0    Mr       Mr
1   Mrs      Mrs
2  Miss     Miss
3    Mr       Mr
4   Mrs      Mrs
5   Mrs      Mrs
6  King     King
7   Man      Man

In [73]:
df['Title'][0]

'Mr'

In [74]:
# Set directory for the data
import os
path = 'C:\\Users\\' + os.getlogin() + '\\Documents\\Programming\\Python\\MachineLearning\\Data'
os.chdir(path)
os.getcwd()
os.listdir()

# Import the train and test data
import pandas as pd
train = pd.read_csv('07-train.csv')
test = pd.read_csv('07-test.csv')

In [75]:
for i in train.Name.head():
    print([i])

['Braund, Mr. Owen Harris']
['Cumings, Mrs. John Bradley (Florence Briggs Thayer)']
['Heikkinen, Miss. Laina']
['Futrelle, Mrs. Jacques Heath (Lily May Peel)']
['Allen, Mr. William Henry']

In [76]:
for i in train.Name.head():
    print(i.split('.'))

['Braund, Mr', ' Owen Harris']
['Cumings, Mrs', ' John Bradley (Florence Briggs Thayer)']
['Heikkinen, Miss', ' Laina']
['Futrelle, Mrs', ' Jacques Heath (Lily May Peel)']
['Allen, Mr', ' William Henry']

In [77]:
for i in train.Name.head():
    print(i.split('.')[0]) # take 1st element
    print(i.split('.')[1])
    print('*'*10)

Braund, Mr
 Owen Harris
**********
Cumings, Mrs
 John Bradley (Florence Briggs Thayer)
**********
Heikkinen, Miss
 Laina
**********
Futrelle, Mrs
 Jacques Heath (Lily May Peel)
**********
Allen, Mr
 William Henry
**********

In [78]:
for i in train.Name.head():
    print((i.split('.')[0]).split(',')[1].strip())

Mr
Mrs
Miss
Mrs
Mr

In [79]:
newtrain = train.loc[1:5]

In [80]:
newtrain

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [81]:
newtitle = []
for i in newtrain.Name:
    newtitle.append((i.split('.')[0]).split(',')[1].strip())
newtitle

['Mrs', 'Miss', 'Mrs', 'Mr', 'Mr']

In [82]:
newtrain['newtitle'] = newtitle

c:\users\david ly\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [83]:
newtrain

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,newtitle
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Mr

In [84]:
newtrain['testTitle'] = [i.split('.')[0].split(',')[1].split() for i in newtrain.Name]

c:\users\david ly\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [85]:
newtrain.testTitle

1     [Mrs]
2    [Miss]
3     [Mrs]
4      [Mr]
5      [Mr]
Name: testTitle, dtype: object

In [86]:
newtrain["aTitle"] = [i.split('.')[0] for i in newtrain.Name]
newtrain["aTitle"] = [i.split(',')[1] for i in newtrain.aTitle] # Gets 2nd element
newtrain

c:\users\david ly\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
c:\users\david ly\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,newtitle,testTitle,aTitle
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,[Mrs],Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,[Miss],Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,[Mrs],Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,[Mr],Mr
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Mr,[Mr],Mr

In [87]:
newtrain['aTitle'].map(lambda x: x.strip())

1     Mrs
2    Miss
3     Mrs
4      Mr
5      Mr
Name: aTitle, dtype: object

In [88]:
newtrain.testTitle.dtype

dtype('O')

In [89]:
newtrain.aTitle.dtype

dtype('O')

In [90]:
dict_a = [{'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}]

In [91]:
dict_a

[{'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}]

In [92]:
dict_a[1]

{'name': 'java', 'points': 8}

In [93]:
dict_a[1].keys

In [94]:
dict_b = {'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}

In [95]:
type(dict_a)

list

In [96]:
squares = {x: x*x for x in range(6)}
squares

{0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

In [97]:
squares.keys()

dict_keys([0, 1, 2, 3, 4, 5])

In [98]:
type(squares)

dict

In [99]:
squares.values()

dict_values([0, 1, 4, 9, 16, 25])

In [100]:
squares.items()

dict_items([(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)])

In [101]:
squares[5]

25

In [102]:
for item in squares.items():
    print(item)

(0, 0)
(1, 1)
(2, 4)
(3, 9)
(4, 16)
(5, 25)

In [103]:
for item in squares.keys():
    print(item)

0
1
2
3
4
5

In [104]:
for item in squares.values():
    print(item)

0
1
4
9
16
25

In [105]:
import pandas as pd
names = ['Jack frost', 'zebra man']
random_df = pd.DataFrame({'names': names, 'number': [1,2]})
random_df

        names  number
0  Jack frost       1
1   zebra man       2

In [106]:
random_df.names.str.split(' ')

0    [Jack, frost]
1     [zebra, man]
Name: names, dtype: object

In [107]:
random_df.names.map(lambda x: x.split(' '))

0    [Jack, frost]
1     [zebra, man]
Name: names, dtype: object

In [108]:
random_df.names.map(lambda x: x.split(' ')[0])

0     Jack
1    zebra
Name: names, dtype: object

In [109]:
random_df.names.map(lambda x: x.split(' ')[1])

0    frost
1      man
Name: names, dtype: object

In [110]:
random_df

        names  number
0  Jack frost       1
1   zebra man       2

In [111]:
import numpy as np
random_df["first"] = np.nan

In [112]:
random_df

        names  number  first
0  Jack frost       1    NaN
1   zebra man       2    NaN

In [113]:
random_df.newcol = np.nan

In [114]:
random_df

        names  number  first
0  Jack frost       1    NaN
1   zebra man       2    NaN

In [115]:
type(random_df.newcol)

float

In [116]:
type(random_df["first"])

pandas.core.series.Series

In [117]:
random_df['first'] = random_df['names'].map(lambda x: x.split(' ')[0])
random_df['last'] = random_df['names'].map(lambda x: x.split(' ')[1])

random_df

        names  number  first   last
0  Jack frost       1   Jack  frost
1   zebra man       2  zebra    man

In [118]:
dict_a = [{'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}]
  
map(lambda x : print(x['name']), dict_a) # Output: ['python', 'java']

In [119]:
tuple_b = {'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}

In [120]:
mydictionary = {'keyname':'somevalue'}

In [121]:
mydictionary.keys()

dict_keys(['keyname'])

In [122]:
mydictionary.values()

dict_values(['somevalue'])

In [123]:
for key, value in mydictionary.items():
    print(key, value)

keyname somevalue